lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "PFR5" -->
        <register>
          <name>PFR5</name>
          <description>Port Function Setting Register 5</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P5F" -->
            <field>
              <name>P5F</name>
              <description>Bit15 of PFR5</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5E" -->
            <field>
              <name>P5E</name>
              <description>Bit14 of PFR5</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5D" -->
            <field>
              <name>P5D</name>
              <description>Bit13 of PFR5</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5C" -->
            <field>
              <name>P5C</name>
              <description>Bit12 of PFR5</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5B" -->
            <field>
              <name>P5B</name>
              <description>Bit11 of PFR5</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P5A" -->
            <field>
              <name>P5A</name>
              <description>Bit10 of PFR5</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P59" -->
            <field>
              <name>P59</name>
              <description>Bit9 of PFR5</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P58" -->
            <field>
              <name>P58</name>
              <description>Bit8 of PFR5</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P57" -->
            <field>
              <name>P57</name>
              <description>Bit7 of PFR5</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P56" -->
            <field>
              <name>P56</name>
              <description>Bit6 of PFR5</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P55" -->
            <field>
              <name>P55</name>
              <description>Bit5 of PFR5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P54" -->
            <field>
              <name>P54</name>
              <description>Bit4 of PFR5</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P53" -->
            <field>
              <name>P53</name>
              <description>Bit3 of PFR5</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P52" -->
            <field>
              <name>P52</name>
              <description>Bit2 of PFR5</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P51" -->
            <field>
              <name>P51</name>
              <description>Bit1 of PFR5</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P50" -->
            <field>
              <name>P50</name>
              <description>Bit0 of PFR5</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR6" -->
        <register>
          <name>PFR6</name>
          <description>Port Function Setting Register 6</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P6E" -->
            <field>
              <name>P6E</name>
              <description>Bit14 of PFR6</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6D" -->
            <field>
              <name>P6D</name>
              <description>Bit13 of PFR6</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6C" -->
            <field>
              <name>P6C</name>
              <description>Bit12 of PFR6</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6B" -->
            <field>
              <name>P6B</name>
              <description>Bit11 of PFR6</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P6A" -->
            <field>
              <name>P6A</name>
              <description>Bit10 of PFR6</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P69" -->
            <field>
              <name>P69</name>
              <description>Bit9 of PFR6</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P68" -->
            <field>
              <name>P68</name>
              <description>Bit8 of PFR6</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P67" -->
            <field>
              <name>P67</name>
              <description>Bit7 of PFR6</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P66" -->
            <field>
              <name>P66</name>
              <description>Bit6 of PFR6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P65" -->
            <field>
              <name>P65</name>
              <description>Bit5 of PFR6</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P64" -->
            <field>
              <name>P64</name>
              <description>Bit4 of PFR6</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P63" -->
            <field>
              <name>P63</name>
              <description>Bit3 of PFR6</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P62" -->
            <field>
              <name>P62</name>
              <description>Bit2 of PFR6</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P61" -->
            <field>
              <name>P61</name>
              <description>Bit1 of PFR6</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P60" -->
            <field>
              <name>P60</name>
              <description>Bit0 of PFR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
