lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "BREG65" -->
        <register>
          <name>BREG65</name>
          <description>Backup Register</description>
          <addressOffset>0x265</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG66" -->
        <register>
          <name>BREG66</name>
          <description>Backup Register</description>
          <addressOffset>0x266</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG67" -->
        <register>
          <name>BREG67</name>
          <description>Backup Register</description>
          <addressOffset>0x267</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG68" -->
        <register>
          <name>BREG68</name>
          <description>Backup Register</description>
          <addressOffset>0x268</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG69" -->
        <register>
          <name>BREG69</name>
          <description>Backup Register</description>
          <addressOffset>0x269</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6A" -->
        <register>
          <name>BREG6A</name>
          <description>Backup Register</description>
          <addressOffset>0x26A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6B" -->
        <register>
          <name>BREG6B</name>
          <description>Backup Register</description>
          <addressOffset>0x26B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6C" -->
        <register>
          <name>BREG6C</name>
          <description>Backup Register</description>
          <addressOffset>0x26C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6D" -->
        <register>
          <name>BREG6D</name>
          <description>Backup Register</description>
          <addressOffset>0x26D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6E" -->
        <register>
          <name>BREG6E</name>
          <description>Backup Register</description>
          <addressOffset>0x26E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6F" -->
        <register>
          <name>BREG6F</name>
          <description>Backup Register</description>
          <addressOffset>0x26F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG70" -->
        <register>
          <name>BREG70</name>
          <description>Backup Register</description>
          <addressOffset>0x270</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG71" -->
        <register>
          <name>BREG71</name>
          <description>Backup Register</description>
          <addressOffset>0x271</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG72" -->
        <register>
          <name>BREG72</name>
          <description>Backup Register</description>
          <addressOffset>0x272</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG73" -->
        <register>
          <name>BREG73</name>
          <description>Backup Register</description>
          <addressOffset>0x273</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG74" -->
        <register>
          <name>BREG74</name>
          <description>Backup Register</description>
          <addressOffset>0x274</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG75" -->
        <register>
          <name>BREG75</name>
          <description>Backup Register</description>
          <addressOffset>0x275</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG76" -->
        <register>
          <name>BREG76</name>
          <description>Backup Register</description>
          <addressOffset>0x276</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG77" -->
        <register>
          <name>BREG77</name>
          <description>Backup Register</description>
          <addressOffset>0x277</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG78" -->
        <register>
          <name>BREG78</name>
          <description>Backup Register</description>
          <addressOffset>0x278</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG79" -->
        <register>
          <name>BREG79</name>
          <description>Backup Register</description>
          <addressOffset>0x279</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7A" -->
        <register>
          <name>BREG7A</name>
          <description>Backup Register</description>
          <addressOffset>0x27A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7B" -->
        <register>
          <name>BREG7B</name>
          <description>Backup Register</description>
          <addressOffset>0x27B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
