lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PLL_CONTROL" -->
    <peripheral>
      <name>PLL_CONTROL</name>
      <description>Main PLL Control</description>
      <groupName>PLL_CONTROL</groupName>
      <baseAddress>0x4003C800</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SSCTL1" -->
        <register>
          <name>SSCTL1</name>
          <description>SSCTL1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000031</resetMask>
        </register>
        <!-- REGISTER "SSCTL2" -->
        <register>
          <name>SSCTL2</name>
          <description>SSCTL2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "EXBUS" -->
    <peripheral>
      <name>EXBUS</name>
      <description>External Bus Interface</description>
      <groupName>EXBUS</groupName>
      <baseAddress>0x4003F000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x300</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "EXTBUS_ERR" -->
      <interrupt>
        <name>EXTBUS_ERR</name>
        <value>49</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MODE0" -->
        <register>
          <name>MODE0</name>
          <description>Mode Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3BFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MOEXEUP" -->
            <field>
              <name>MOEXEUP</name>
              <description>select how to set the MOEX width</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXCSOF" -->
            <field>
              <name>MPXCSOF</name>
              <description>select a CS assertion from the start of accessing to the end of address output</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXDOFF" -->
            <field>
              <name>MPXDOFF</name>
              <description>select whether or not the address is output to the data lines in multiplex mode</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALEINV" -->
            <field>
              <name>ALEINV</name>
              <description>set up the polarity of the ALE signal</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPXMODE" -->
            <field>
              <name>MPXMODE</name>
              <description>select operation bus mode</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SHRTDOUT" -->
            <field>
              <name>SHRTDOUT</name>
              <description>select to which idle cycle the write data output is extended</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>control the external RDY function</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAGE" -->
            <field>
              <name>PAGE</name>
              <description>NOR Flash memory page access mode </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NAND" -->
            <field>
              <name>NAND</name>
              <description>NAND Flash memory mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WEOFF" -->
            <field>
              <name>WEOFF</name>
              <description>disable the write enable signal (MWEX) operation</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBMON" -->
            <field>
              <name>RBMON</name>
              <description>Read Byte Mask ON</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDTH" -->
            <field>
              <name>WDTH</name>
              <description>specify Data Width </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MODE1" -->
        <register derivedFrom="MODE0">
          <name>MODE1</name>
          <description>Mode Register 1</description>
          <addressOffset>0x4</addressOffset>
        </register>
        <!-- REGISTER "MODE2" -->
        <register derivedFrom="MODE0">
          <name>MODE2</name>
          <description>Mode Register 2</description>
          <addressOffset>0x8</addressOffset>
        </register>
