lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "MAR7L" -->
        <register derivedFrom="MAR1L">
          <name>MAR7L</name>
          <description>MAC Address7 Register -Low</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "MAR8H" -->
        <register derivedFrom="MAR1H">
          <name>MAR8H</name>
          <description>MAC Address8 Register -High</description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "MAR8L" -->
        <register derivedFrom="MAR1L">
          <name>MAR8L</name>
          <description>MAC Address8 Register -Low</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "MAR9H" -->
        <register derivedFrom="MAR1H">
          <name>MAR9H</name>
          <description>MAC Address9 Register -High</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "MAR9L" -->
        <register derivedFrom="MAR1L">
          <name>MAR9L</name>
          <description>MAC Address9 Register -Low</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "MAR10H" -->
        <register derivedFrom="MAR1H">
          <name>MAR10H</name>
          <description>MAC Address10 Register -High</description>
          <addressOffset>0x90</addressOffset>
        </register>
        <!-- REGISTER "MAR10L" -->
        <register derivedFrom="MAR1L">
          <name>MAR10L</name>
          <description>MAC Address10 Register -Low</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "MAR11H" -->
        <register derivedFrom="MAR1H">
          <name>MAR11H</name>
          <description>MAC Address11 Register -High</description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "MAR11L" -->
        <register derivedFrom="MAR1L">
          <name>MAR11L</name>
          <description>MAC Address11 Register -Low</description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "MAR12H" -->
        <register derivedFrom="MAR1H">
          <name>MAR12H</name>
          <description>MAC Address12 Register -High</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "MAR12L" -->
        <register derivedFrom="MAR1L">
          <name>MAR12L</name>
          <description>MAC Address12 Register -Low</description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "MAR13H" -->
        <register derivedFrom="MAR1H">
          <name>MAR13H</name>
          <description>MAC Address13 Register -High</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "MAR13L" -->
        <register derivedFrom="MAR1L">
          <name>MAR13L</name>
          <description>MAC Address13 Register -Low</description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "MAR14H" -->
        <register derivedFrom="MAR1H">
          <name>MAR14H</name>
          <description>MAC Address14 Register -High</description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "MAR14L" -->
        <register derivedFrom="MAR1L">
          <name>MAR14L</name>
          <description>MAC Address14 Register -Low</description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "MAR15H" -->
        <register derivedFrom="MAR1H">
          <name>MAR15H</name>
          <description>MAC Address15 Register -High</description>
          <addressOffset>0xB8</addressOffset>
        </register>
        <!-- REGISTER "MAR15L" -->
        <register derivedFrom="MAR1L">
          <name>MAR15L</name>
          <description>MAC Address15 Register -Low</description>
          <addressOffset>0xBC</addressOffset>
        </register>
        <!-- REGISTER "RGSR" -->
        <register>
          <name>RGSR</name>
          <description>RGMII Status Register)</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LS" -->
            <field>
              <name>LS</name>
              <description>Link Status</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LSP" -->
            <field>
              <name>LSP</name>
              <description>Link Speed</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LM" -->
            <field>
              <name>LM</name>
              <description>Link Mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "mmc_cntl" -->
        <register>
          <name>mmc_cntl</name>
          <description>MMC Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_rx" -->
        <register>
          <name>mmc_intr_rx</name>
          <description>Receive Interrupt Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_tx" -->
        <register>
          <name>mmc_intr_tx</name>
          <description>MMC Transmit Interrupt Register </description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_mask_rx" -->
        <register>
          <name>mmc_intr_mask_rx</name>
          <description>MMC Receive Interrupt Mask Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_mask_tx" -->
        <register>
          <name>mmc_intr_mask_tx</name>
          <description>MMC Transmit Interrupt Mask Register </description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
        </register>
        <!-- REGISTER "txoctetcount_gb" -->
        <register>
          <name>txoctetcount_gb</name>
          <description>"Number of bytes transmitted, exclusive of preamble and retried bytes, in good and bad frames"</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txframecount_gb" -->
        <register>
          <name>txframecount_gb</name>
          <description>"Number of good and bad frames transmitted, exclusive of retried frames"</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txbroadcastframes_g" -->
        <register>
          <name>txbroadcastframes_g</name>
          <description>Number of good broadcast frames transmitted</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txmulticastframes_g" -->
        <register>
          <name>txmulticastframes_g</name>
          <description>Number of good multicast frames transmitted</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx64octets_gb" -->
        <register>
          <name>tx64octets_gb</name>
          <description>"Number of good and bad frames transmitted with length of 64 bytes, exclusive of preamble and retried frames"</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx65to127octets_gb" -->
        <register>
          <name>tx65to127octets_gb</name>
          <description>"Number of good and bad frames transmitted with length between 65 and 127 (inclusive) bytes, exclusive of preamble and retried frames"</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx128to255octets_gb" -->
        <register>
          <name>tx128to255octets_gb</name>
          <description>"Number of good and bad frames transmitted with length between 128 and 255 (inclusive) bytes, exclusive of preamble and retried frames"</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx256to511octets_gb" -->
        <register>
          <name>tx256to511octets_gb</name>
          <description>"Number of good and bad frames transmitted with length between 256 and 511 (inclusive) bytes, exclusive of preamble and retried frames"</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
