lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "tx512to1023octets_gb" -->
        <register>
          <name>tx512to1023octets_gb</name>
          <description>"Number of good and bad frames transmitted with length between 512 and 1023 (inclusive) bytes, exclusive of preamble and retried frames"</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx1024tomaxoctets_gb" -->
        <register>
          <name>tx1024tomaxoctets_gb</name>
          <description>"Number of good and bad frames transmitted with length between 1024 and Maxsize (inclusive) bytes, exclusive of preamble and retried frames"</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txunicastframes_gb" -->
        <register>
          <name>txunicastframes_gb</name>
          <description>Number of good and bad unicast frames transmitted</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txmulticastframes_gb" -->
        <register>
          <name>txmulticastframes_gb</name>
          <description>Number of good and bad multicast frames transmitted</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txbroadcastframes_gb" -->
        <register>
          <name>txbroadcastframes_gb</name>
          <description>Number of good and bad broadcast frames transmitted</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txunderflowerror" -->
        <register>
          <name>txunderflowerror</name>
          <description>Number of frames aborted due to frame underflow error</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txsinglecol_g" -->
        <register>
          <name>txsinglecol_g</name>
          <description>Number of successfully transmitted frames after a single collision in Half-duplex mode </description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txmulticol_g" -->
        <register>
          <name>txmulticol_g</name>
          <description>Number of successfully transmitted frames after more than a single collision in Half-duplex mode</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txdeferred" -->
        <register>
          <name>txdeferred</name>
          <description>Number of successfully transmitted frames after a deferral in Half-duplex mode.</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txlatecol" -->
        <register>
          <name>txlatecol</name>
          <description>Number of frames aborted due to late collision error. </description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txexesscol" -->
        <register>
          <name>txexesscol</name>
          <description>Number of frames aborted due to excessive (16) collision errors. </description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txcarriererror" -->
        <register>
          <name>txcarriererror</name>
          <description>Number of frames aborted due to carrier sense error (no carrier or loss of carrier).  </description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txoctetcount_g" -->
        <register>
          <name>txoctetcount_g</name>
          <description>"Number of bytes transmitted, exclusive of preamble, in good frames only. "</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txframecount_g" -->
        <register>
          <name>txframecount_g</name>
          <description>Number of good frames transmitted. </description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txexecessdef_g" -->
        <register>
          <name>txexecessdef_g</name>
          <description>Number of frames aborted due to excessive deferral error (deferred for more than two max-sized frame times).</description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txpauseframes" -->
        <register>
          <name>txpauseframes</name>
          <description>Number of good PAUSE frames transmitted. </description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
