lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "rxicmp_gd_frms" -->
        <register>
          <name>rxicmp_gd_frms</name>
          <description>Number of good IP datagrams with a good ICMP payload </description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_err_frms" -->
        <register>
          <name>rxicmp_err_frms</name>
          <description>Number of good IP datagrams whose ICMP payload has a checksum error</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_gd_octets" -->
        <register>
          <name>rxipv4_gd_octets</name>
          <description>"Number of bytes received in good IPv4 datagrams encapsulating TCP, UDP, or ICMP data. (Ethernet header, FCS, pad, or IP pad bytes are not included in this counter or in the octet counters listed below).  "</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_hdrerr_octets" -->
        <register>
          <name>rxipv4_hdrerr_octets</name>
          <description>"Number of bytes received in IPv4 datagrams with header errors (checksum, length, version mismatch). The value in the Length field of IPv4 header is used to update this counter. "</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_nopay_octets" -->
        <register>
          <name>rxipv4_nopay_octets</name>
          <description>"Number of bytes received in IPv4 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv4 header's Length field is used to update this counter. "</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_frag_octets" -->
        <register>
          <name>rxipv4_frag_octets</name>
          <description>Number of bytes received in fragmented IPv4 datagrams. The value in the IPv4 header's Length field is used to update this counter. </description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_udsbl_octets" -->
        <register>
          <name>rxipv4_udsbl_octets</name>
          <description>Number of bytes received in a UDP segment that had the UDP checksum disabled. This counter does not count IP Header bytes. </description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_gd_octets" -->
        <register>
          <name>rxipv6_gd_octets</name>
          <description>"Number of bytes received in good IPv6 datagrams encapsulating TCP, UDP or ICMPv6 data"</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_hdrerr_octets" -->
        <register>
          <name>rxipv6_hdrerr_octets</name>
          <description>"Number of bytes received in IPv6 datagrams with header errors (length, version mismatch). The value in the IPv6 header's Length field is used to update this counter.  "</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_nopay_octets" -->
        <register>
          <name>rxipv6_nopay_octets</name>
          <description>"Number of bytes received in IPv6 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv6 header's Length field is used to update this counter. "</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_gd_octets" -->
        <register>
          <name>rxudp_gd_octets</name>
          <description>Number of bytes received in a good UDP segment. This counter (and the counters below) does not count IP header bytes. </description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_err_octets" -->
        <register>
          <name>rxudp_err_octets</name>
          <description>Number of bytes received in a UDP segment that had checksum errors</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_gd_octets" -->
        <register>
          <name>rxtcp_gd_octets</name>
          <description>Number of bytes received in a good TCP segment </description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_err_octets" -->
        <register>
          <name>rxtcp_err_octets</name>
          <description>Number of bytes received in a TCP segment with checksum errors </description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_gd_octets" -->
        <register>
          <name>rxicmp_gd_octets</name>
          <description>Number of bytes received in a good ICMP segment </description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_err_octets" -->
        <register>
          <name>rxicmp_err_octets</name>
          <description>Number of bytes received in an ICMP segment with checksum errors</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
