lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "PRGCRC_RD" -->
        <register>
          <name>PRGCRC_RD</name>
          <description>CRC Computing Output Data Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "HSSPI" -->
    <peripheral>
      <name>HSSPI</name>
      <description>HI-SPEED SPI Controller</description>
      <groupName>HSSPI</groupName>
      <baseAddress>0xD0000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x35</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3A</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xDC</offset>
        <size>0x32</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x404</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "HSSPI" -->
      <interrupt>
        <name>HSSPI</name>
        <value>115</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MCTRL" -->
        <register>
          <name>MCTRL</name>
          <description>Control Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000033</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SYNCON" -->
            <field>
              <name>SYNCON</name>
              <description>Synchronizer circuit operation bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MES" -->
            <field>
              <name>MES</name>
              <description>Module enable status bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSEN" -->
            <field>
              <name>CSEN</name>
              <description>Command sequencer mode enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MEN" -->
            <field>
              <name>MEN</name>
              <description>Module enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCC0" -->
        <register>
          <name>PCC0</name>
          <description>Peripheral Communication Setting Register 0</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDDSEL" -->
            <field>
              <name>RDDSEL</name>
              <description>Read deselect time setting bits</description>
              <lsb>21</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRDSEL" -->
            <field>
              <name>WRDSEL</name>
              <description>Write or different command deselect time setting bits</description>
              <lsb>17</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAFESYNC" -->
            <field>
              <name>SAFESYNC</name>
              <description>Safe synchronization bit</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDRS" -->
            <field>
              <name>CDRS</name>
              <description>Clock division ratio setting bits</description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SENDIAN" -->
            <field>
              <name>SENDIAN</name>
              <description>Endian setting bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDIR" -->
            <field>
              <name>SDIR</name>
              <description>Shift direction setting bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SS2CD" -->
            <field>
              <name>SS2CD</name>
              <description>Slave-select-to-clock-start delay time setting bit</description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSPOL" -->
            <field>
              <name>SSPOL</name>
              <description>Slave select polarity setting bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTM" -->
            <field>
              <name>RTM</name>
              <description>Timing compensation setting bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACES" -->
            <field>
              <name>ACES</name>
              <description>Serial data transmission/reception timing setting bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPOL" -->
            <field>
              <name>CPOL</name>
              <description>Serial clock polarity setting bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPHA" -->
            <field>
              <name>CPHA</name>
              <description>Clock phase setting bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCC1" -->
        <register derivedFrom="PCC0">
          <name>PCC1</name>
          <description>Peripheral Communication Setting Registers 1</description>
          <addressOffset>0x08</addressOffset>
        </register>
        <!-- REGISTER "PCC2" -->
        <register derivedFrom="PCC0">
          <name>PCC2</name>
          <description>Peripheral Communication Setting Registers 2</description>
          <addressOffset>0x0C</addressOffset>
        </register>
