lkolbly/cmsis-svd/data/Cypress/S6E2C2.svd
        <!-- REGISTER "RXC" -->
        <register>
          <name>RXC</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSSRC" -->
            <field>
              <name>RSSRC</name>
              <description>Slave select released detection clear bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFMTC" -->
            <field>
              <name>RFMTC</name>
              <description>RX-FIFO-exceeded-threshold detection clear bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFLETC" -->
            <field>
              <name>RFLETC</name>
              <description>RX-FIFO-less-than-or-equal-to-threshold detection clear bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFUC" -->
            <field>
              <name>RFUC</name>
              <description>RX-FIFO underrun detection clear bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFOC" -->
            <field>
              <name>RFOC</name>
              <description>RX-FIFO overrun detection clear bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFEC" -->
            <field>
              <name>RFEC</name>
              <description>RX-FIFO and shift register empty-state detection clear bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFFC" -->
            <field>
              <name>RFFC</name>
              <description>RX-FIFO full detection clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FAULTF" -->
        <register>
          <name>FAULTF</name>
          <description>Fault Interrupt Factor Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRCBSFS" -->
            <field>
              <name>DRCBSFS</name>
              <description>DRCBSFS</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DWCBSFS" -->
            <field>
              <name>DWCBSFS</name>
              <description>DWCBSFS</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PVFS" -->
            <field>
              <name>PVFS</name>
              <description>Protection violation fault detection bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAFS" -->
            <field>
              <name>WAFS</name>
              <description>Write access fault detection bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UMAFS" -->
            <field>
              <name>UMAFS</name>
              <description>Unmapped memory access fault detection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FAULTC" -->
        <register>
          <name>FAULTC</name>
          <description>Fault Interrupt Clear Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRCBSFC" -->
            <field>
              <name>DRCBSFC</name>
              <description>DRCBSFC</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "DWCBSFC" -->
            <field>
              <name>DWCBSFC</name>
              <description>DWCBSFC</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "PVFC" -->
            <field>
              <name>PVFC</name>
              <description>Protection violation fault detection clear bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "WAFC" -->
            <field>
              <name>WAFC</name>
              <description>Write access fault detection clear bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "UMAFC" -->
            <field>
              <name>UMAFC</name>
              <description>Unmapped memory access fault detection clear bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMCFG" -->
        <register>
          <name>DMCFG</name>
          <description>Direct Mode Setting Register</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x02</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSDC" -->
            <field>
              <name>SSDC</name>
              <description>Slave select deassertion setting bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMDMAEN" -->
        <register>
          <name>DMDMAEN</name>
          <description>DMDMAEN</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDMAEN" -->
            <field>
              <name>TXDMAEN</name>
              <description>TXDMAEN</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDMAEN" -->
            <field>
              <name>RXDMAEN</name>
              <description>RXDMAEN</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMSTART" -->
        <register>
          <name>DMSTART</name>
          <description>Direct Mode Transfer Start Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "START" -->
            <field>
              <name>START</name>
              <description>Transfer start bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
